       FD  USER-FILE.
       01  FD-USER-RECORD.
           05  FD-USER-ID          PIC X(10).
           05  FD-USER-NAME        PIC X(30).
           05  FD-USER-ROLE        PIC X(15).
           05  FD-USER-LAST-LOGIN  PIC 9(08).
